app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE (title ILIKE ('%lang%') or text ILIKE ('%lang%'))
SELECT  "articles".* FROM "articles" ORDER BY "articles"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
	def index
     if params[:search]
     @articles = Article.where('title LIKE ?', "%#{params[:search]}%").all
     else
      @articles = Article.all

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "xxxxxx"], ["text", "xxxx"], ["created_at", 2016-08-12 08:26:21 UTC], ["updated_at", 2016-08-12 08:26:21 UTC]]
---
	def create
    @article = Article.new(article_params)
      if @article.save